import numpy as np
import pandas as pd
import os
os.chdir("C:/Users/pasha/OneDrive/Рабочий стол")

phones = pd.ExcelFile("iphone1.xlsx")
phone_prices = phones.parse('Лист1')
phone_prices

D = np.hstack((phone_prices.values[:,1:2], 
               phone_prices.values[:,5:10])).astype(np.single) # Присваиваем D значения всех строк 2 и 6-8 столбцов
Y = phone_prices.values[:,4:5].astype(np.int32).flatten() # Присваиваем Y значения всех строк 5 столбца (память телефона)

for i in range(len(D[0])): # шкалируем данные (необходимо для последнего Output, см. ниже)
    a, b = np.polyfit(
        np.sort(D[:,i]),
        np.linspace(0,1,len(D[:,i])),1
    )
    D[:,i] = D[:,i] * a + b

w0 = np.zeros((len(D[0])))
w1 = np.zeros_like(w0)
w2 = np.zeros_like(w0)
w3 = np.zeros_like(w0)

Y = Y.flatten()
Y0 = np.zeros_like(Y)
Y1 = np.zeros_like(Y)
Y2 = np.zeros_like(Y)
Y3 = np.zeros_like(Y)

Y0[np.where(Y==128)] = 1
Y1[np.where(Y==256)] = 1
Y2[np.where(Y==512)] = 1
Y3[np.where(Y==1024)] = 1
n = 0
print(D)
for y in [Y0, Y1, Y2, Y3]:
    print(y)

α =  0.2 
β = -0.4 
σ = lambda x: 1 if x > 0 else 0

def f(x, _w):
    s = β + np.sum(x @ _w)
    return σ(s)

def train(w, D, Y):
    _w = w.copy()
    for x, y in zip(D, Y):
        w += α * (y - f(x, w)) * x
    return (w != _w).any()

while train(w0, D, Y0) and \
      train(w1, D, Y1) and \
      train(w2, D, Y2) and \
      train(w3, D, Y3) and \
      n < 1000000: # В зависимости от продолжительности обучения, результат немного меняется
          print([ round(x) for x in w1 ])
          n += 1

for x in D:
    print(x, end=' > ')
    for w in [w0,w1,w2,w3]:
        print(f(x,w), end=', ')
    print()
    
'''
Output без шкалирования при n = 1 000 000:

    1, 1, 1, 0, 
    1, 1, 1, 0, 
    0, 1, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 1, 0, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    
Output без шкалирования при n = 100 000:
    
    1, 1, 1, 0, 
    1, 1, 1, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    
Output без шкалирования при n = 10 000:
    
    0, 0, 0, 0, 
    1, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    
Output без шкалирования при n = 1 000, 100, 10:
    
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    
Output со шкалированием:
    
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 1, 
    0, 0, 0, 1, 
'''